#include "Atbash.h"
#include <string>
#include <iostream>
#include <unordered_map>
#include <windows.h>


std::string Atbash(const std::string& input)
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
	static const std::unordered_map<char, char> Atbash = {
    {'A', 'Z'}, {'B', 'Y'}, {'C', 'X'}, {'D', 'W'}, {'E', 'V'},
    {'F', 'U'}, {'G', 'T'}, {'H', 'S'}, {'I', 'R'}, {'J', 'Q'},
    {'K', 'P'}, {'L', 'O'}, {'M', 'N'}, {'N', 'M'}, {'O', 'L'},
    {'P', 'K'}, {'Q', 'J'}, {'R', 'I'}, {'S', 'H'}, {'T', 'G'},
    {'U', 'F'}, {'V', 'E'}, {'W', 'D'}, {'X', 'C'}, {'Y', 'B'},
    {'Z', 'A'},

    {'a', 'z'}, {'b', 'y'}, {'c', 'x'}, {'d', 'w'}, {'e', 'v'},
    {'f', 'u'}, {'g', 't'}, {'h', 's'}, {'i', 'r'}, {'j', 'q'},
    {'k', 'p'}, {'l', 'o'}, {'m', 'n'}, {'n', 'm'}, {'o', 'l'},
    {'p', 'k'}, {'q', 'j'}, {'r', 'i'}, {'s', 'h'}, {'t', 'g'},
    {'u', 'f'}, {'v', 'e'}, {'w', 'd'}, {'x', 'c'}, {'y', 'b'},
    {'z', 'a'},

    {'À', 'ß'}, {'Á', 'Þ'}, {'Â', 'Ý'}, {'Ã', 'Ü'}, {'Ä', 'Û'},
    {'Å', 'Ú'}, {'¨', 'Ù'}, {'Æ', 'Ø'}, {'Ç', '×'}, {'È', 'Ö'},
    {'É', 'Õ'}, {'Ê', 'Ô'}, {'Ë', 'Ó'}, {'Ì', 'Ò'}, {'Í', 'Ñ'},
    {'Î', 'Ð'}, {'Ï', 'Ï'}, {'Ð', 'Î'}, {'Ñ', 'Í'}, {'Ò', 'Ì'},
    {'Ó', 'Ë'}, {'Ô', 'Ê'}, {'Õ', 'É'}, {'Ö', 'È'}, {'×', 'Ç'},
    {'Ø', 'Æ'}, {'Ù', '¨'}, {'Ú', 'Å'}, {'Û', 'Ä'}, {'Ü', 'Ã'},
    {'Ý', 'Â'}, {'Þ', 'Á'}, {'ß', 'À'},

    {'à', 'ÿ'}, {'á', 'þ'}, {'â', 'ý'}, {'ã', 'ü'}, {'ä', 'û'},
    {'å', 'ú'}, {'¸', 'ù'}, {'æ', 'ø'}, {'ç', '÷'}, {'è', 'ö'},
    {'é', 'õ'}, {'ê', 'ô'}, {'ë', 'ó'}, {'ì', 'ò'}, {'í', 'ñ'},
    {'î', 'ð'}, {'ï', 'ï'}, {'ð', 'î'}, {'ñ', 'í'}, {'ò', 'ì'},
    {'ó', 'ë'}, {'ô', 'ê'}, {'õ', 'é'}, {'ö', 'è'}, {'÷', 'ç'},
    {'ø', 'æ'}, {'ù', '¸'}, {'ú', 'å'}, {'û', 'ä'}, {'ü', 'ã'},
    {'ý', 'â'}, {'þ', 'á'}, {'ÿ', 'à'}
    };
    std::string result;
    for (char c : input)
    {
        auto let = Atbash.find(c);
        if (let != Atbash.end())
            result += let->second;
        else
            result += c;
    }
    return result;
}